package main.leetcode.editor.cn;//给定一个正整数 n，编写一个函数，获取一个正整数的二进制形式并返回其二进制表达式中 设置位 的个数（也被称为汉明重量）。
//
// 
//
// 示例 1： 
//
// 
//输入：n = 11
//输出：3
//解释：输入的二进制串 1011 中，共有 3 个设置位。
// 
//
// 示例 2： 
//
// 
//输入：n = 128
//输出：1
//解释：输入的二进制串 10000000 中，共有 1 个设置位。
// 
//
// 示例 3： 
//
// 
//输入：n = 2147483645
//输出：30
//解释：输入的二进制串 1111111111111111111111111111101 中，共有 30 个设置位。 
//
// 
//
// 提示： 
//
// 
// 1 <= n <= 2³¹ - 1 
// 
//
// 
// 
//
// 
//
// 进阶： 
//
// 
// 如果多次调用这个函数，你将如何优化你的算法？ 
// 
//
// Related Topics 位运算 分治 👍 657 👎 0


import main.customUtil.AssertExample;

//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    //    @AssertExample(params = "1", expectResult = "0")
    public int hammingWeight(int n) {
        int m;
        m = 0b01010101_01010101_01010101_01010101;
        n = (n & m) + ((n >>> 1) & m);
        m = 0b00110011_00110011_00110011_00110011;
        n = (n & m) + ((n >>> 2) & m);
        m = 0b00001111_00001111_00001111_00001111;
        n = (n & m) + ((n >>> 4) & m);
        m = 0b00000000_11111111_00000000_11111111;
        n = (n & m) + ((n >>> 8) & m);
        m = 0b00000000_00000000_11111111_11111111;
        n = (n & m) + ((n >>> 16) & m);
        return n;
    }
}
//leetcode submit region end(Prohibit modification and deletion)

// 	执行耗时:0 ms,击败了100.00% 的Java用户
//	内存消耗:39.7 MB,击败了61.30% 的Java用户
// 很久之前看过的算法思想，凭一点印象复现了，竟然能降到log log n复杂度（32位是log n，运算5次是 log 32，把n看作规模即得），真的是神奇
// 算是一种分治吧，这种位运算和算术运算结合真是一般想不到
