package main.problemAndSolving.nowcoder_20241221.THJ18识别有效的IP地址和掩码并进行分类统计;

import java.util.Scanner;

// 较难  通过率：15.69%  时间限制：1秒  空间限制：32M
//知识点
//字符串
//查找
//warning 校招时部分企业笔试将禁止编程题跳出页面，为提前适应，练习时请使用在线自测，而非本地IDE。
//描述
//在本题中，我们需要处理地址信息，其由
//I
//P
//IP 地址和子网掩码组成，这两者均形如
//"*.*.*.*"
//"*.*.*.*" ，由四段数字组成，每段数字之间以点分隔。
//
//我们定义五类
//I
//P
//IP 地址：
//∙
// 
//∙A类：
//"1.0.0.0"-"126.255.255.255"
//"1.0.0.0"-"126.255.255.255" ；
//∙
// 
//∙B类：
//"128.0.0.0"-"191.255.255.255"
//"128.0.0.0"-"191.255.255.255" ；
//∙
// 
//∙C类：
//"192.0.0.0"-"223.255.255.255"
//"192.0.0.0"-"223.255.255.255" ；
//∙
// 
//∙D类：
//"224.0.0.0"-"239.255.255.255"
//"224.0.0.0"-"239.255.255.255" ；
//∙
// 
//∙E类：
//"240.0.0.0"-"255.255.255.255"
//"240.0.0.0"-"255.255.255.255" 。
//
//我们定义私有
//I
//P
//IP 地址：
//∙
// 
//∙
//"10.0.0.0"-"10.255.255.255"
//"10.0.0.0"-"10.255.255.255" ；
//∙
// 
//∙
//"172.16.0.0"-"172.31.255.255"
//"172.16.0.0"-"172.31.255.255" ；
//∙
// 
//∙
//"192.168.0.0"-"192.168.255.255"
//"192.168.0.0"-"192.168.255.255" 。
//
//我们定义合法的子网掩码：
//∙
// 
//∙将
//I
//P
//IP 地址转换为二进制后，必须由若干个连续的
//1
//1 后跟若干个连续的
//0
//0 组成；
//∙
// 
//∙例如，
//"1.1.1.5"
//"1.1.1.5" 是一个非法的子网掩码，因为它转换为二进制后为
//1.1.1.101
//1.1.1.101 ，中间出现了
//0
//0 后又出现了
//1
//1 ；
//∙
// 
//∙注意，全为
//1
//1 或全为
//0
//0 的子网掩码也是非法的。
//
//现在，你需要分类统计ABCDE类地址的数量、错误
//IP
//IP 或错误子网掩码的数量、私有
//IP
//IP 的数量。
//
//特别地，我们还有以下提示：
//∙
// 
//∙类似于
//"0.*.*.*"
//"0.*.*.*" 和
//"127.*.*.*"
//"127.*.*.*" 的
//I
//P
//IP 地址不属于上述输入的任意一类，也不属于不合法
//I
//P
//IP 地址；
//∙
// 
//∙一个
//I
//P
//IP 地址既可以是私有
//I
//P
//IP 地址，也可以是五类
//I
//P
//IP 地址之一，计数时请分别计入。
//输入描述：
//本题将会给出
//1
//≦
//T
//≦
//1000
//1≦T≦1000 条地址信息，确切数字未知，您需要一直读入直到文件结尾；您也可以参考 牛客网在线判题系统使用帮助 获得更多的使用帮助。每条地址信息描述如下：
//
//在一行上先输入一个字符串，代表
//I
//P
//IP 地址；随后，在同一行输入一个字符串，代表子网掩码；使用
//"
//
//"
//" " 分隔。
//输出描述：
//在一行上输出七个整数，分别代表ABCDE类地址的数量、错误
//IP
//IP 或错误子网掩码的数量、私有
//IP
//IP 的数量。
//示例1
//输入：
//10.70.44.68~1.1.1.5
//1.0.0.1~255.0.0.0
//192.168.0.2~255.255.255.0
//19..0.~255.255.255.0
//复制
//输出：
//1 0 1 0 0 2 1
//复制
//说明：
//对于第一条地址信息，
//"10.70.44.68"
//"10.70.44.68" 是其
//I
//P
//IP 地址，
//"255.254.255.0"
//"255.254.255.0" 是其子网掩码；该条地址的子网掩码非法。
//对于第二条地址信息，
//I
//P
//IP 地址和子网掩码均无误，且属于A类地址。
//对于第三条地址信息，
//I
//P
//IP 地址和子网掩码均无误，且属于C类地址，同时属于私有
//I
//P
//IP 地址。
//对于第四条地址信息，
//I
//P
//IP 地址非法。
//示例2
//输入：
//0.201.56.50~255.255.255.0
//127.201.56.50~255.255.111.255
//复制
//输出：
//0 0 0 0 0 0 0
//复制
//说明：
//对于第一、二条地址信息，均属于上方提示中提到的特殊
//I
//P
//IP 地址，不需要处理，直接跳过。
//特别地，第二条地址的子网掩码是非法的。但是因为该条为特殊
//I
//P
//IP 地址，此优先级更高，所以不进入统计。
public class Main {
    public static void main(String[] args) {
        int a = 0;
        int b = 0;
        int c = 0;
        int d = 0;
        int e = 0;
        int wrong = 0;
        int local = 0;
        long[][] sec = new long[3][2];
        sec[0][0] = cvt("10.0.0.0");
        sec[0][1] = cvt("10.255.255.255");
        sec[1][0] = cvt("172.16.0.0");
        sec[1][1] = cvt("172.31.255.255");
        sec[2][0] = cvt("192.168.0.0");
        sec[2][1] = cvt("192.168.255.255");
        Scanner scanner = new Scanner(System.in);
        while (scanner.hasNextLine()) {
            String[] strings = scanner.nextLine().split("~");
            if (strings[0].startsWith("0.") || strings[0].startsWith("127.")) {
                continue;
            }
            long ip = cvt(strings[0]);
            long mask = cvt(strings[1]);
            if (ip == -1 || mask == -1) {
                wrong++;
                continue;
            }
            long temp = mask;
            for (int i = 31; i >= 0; i--) {
                if ((temp & (1L << i)) > 0) {
                    temp ^= (1L << i);
                } else {
                    break;
                }
            }
            if (temp > 0 || mask == 0 || mask == 0xffff_ffffL) {
                // 非法掩码
                wrong++;
                continue;
            }
            if (contain(sec, ip)) {
                local++;
            }
            if ((ip & 0x8000_0000L) == 0) {
                a++;
            } else if ((ip & 0xc000_0000L) == 0x8000_0000L) {
                b++;
            } else if ((ip & 0xe000_0000L) == 0xc000_0000L) {
                c++;
            } else if ((ip & 0xf000_0000L) == 0xe000_0000L) {
                d++;
            } else {
                e++;
            }
        }
        System.out.println(a + " " + b + " " + c + " " + d + " " + e + " " + wrong + " " + local);
    }

    private static boolean contain(long[][] sec, long ip) {
        for (long[] longs : sec) {
            if (ip >= longs[0] && ip <= longs[1]) {
                return true;
            }
        }
        return false;
    }

    public static long cvt(String ip) {
        String[] args = ip.split("\\.");  // 分隔符转义问题，切记注意
        if (args.length < 4) {
            return -1;
        }
        long ans = 0;
        for (int i = 0; i < 4; i++) {
            ans <<= 8;
            if (args[i].length() == 0) {
                return -1;
            }
            ans |= Integer.parseInt(args[i]);
        }
        return ans;
    }
}
